'''Решение квадратного уравнения'''

a1 = int(input("Введите коэффициент a"))
b1 = int(input("Введите коэффициент b"))
c1 = int(input("Введите коэффициент c"))


def cvyr(a, b, c):
    """Функция"""

    disk = b**2 - 4*a*c
    if disk > 0:
        x1 = (b**2 + disk**0.5) / 2*a
        x2 = (b**2 - disk**0.5) / 2*a
        return (
            "Дискриминант > 0, квадратное уравнение имеет 2 корня",
            disk,
            x1,
            x2
        )

    if disk == 0:
        x = -b/2*a
        return "Дискриминант = 0, квадратное уравнение имеет 1 корень", disk, x
    if disk < 0:
        return "Корней нет", disk
